{
  "ECBA": {
    "title": "창공의 독수리",
    "icon": "🦅",
    "summaryTitle": "The Eagle of the Skies",
    "description": "당신은 아침의 상승기류를 타고 창공으로 날아오르는 독수리와 같습니다. 고요하고 안정된 마음으로 드넓은 세상을 내려다보며, 지치지 않는 날갯짓으로 몇 시간이고 하늘에 머무를 수 있는 지구력을 가졌습니다. 사소한 바람에는 흔들리지 않고, 뚜렷한 목표를 향해 침착하고 꾸준하게 나아갑니다. 당신의 비행은 견고하고 에너지 넘치는 식사를 통해 완성됩니다.",
    "analysis": {
      "E": "E (아침형 / Morning-Type): 당신의 신체 시계는 일찍 시작됩니다. 뇌와 신체 기능은 오전에 최고조에 달합니다.",
      "C": "C (차분형 / Calm-Type): 스트레스에 대한 회복탄력성이 높고, 감정적으로 안정된 성향을 가집니다.",
      "B": "B (Bacteroides형 / Bacteroides-Type): 당신의 장은 단백질과 지방을 소화하고 활용하는 데 최적화되어 있습니다.",
      "A": "A (에어로빅형 / Aerobic-Type): 당신의 근육은 폭발적인 힘보다는 오랜 시간 지치지 않는 지구력에 특화되어 있으며, 근육의 밀도와 선명도를 높이는 데 강점이 있습니다."
    },
    "strategies": [
      {
        "category": "운동",
        "categoryIcon": "🏋️‍♂️",
        "title": "탄탄하고 선명한 몸매를 조각하라",
        "content": "당신은 에어로빅형(A)으로서, 거대한 근육보다는 지방이 적고 근육의 선명도가 높은 탄탄하고 밀도 있는 몸매를 만드는 데 최고의 잠재력을 가지고 있습니다.",
        "synergy": "당신의 운동 시너지는 '지치지 않는 지구력(A)과 고요한 인내심(C), 그리고 맑은 아침의 에너지(E)'의 만남입니다. 에어로빅형의 강점을 가진 당신은, 차분한 성향 덕분에 다른 사람들이 쉽게 지루함을 느끼는 고반복 훈련이나 긴 유산소 운동을 묵묵히 해낼 수 있습니다. 이 훈련을 가장 좋은 컨디션으로 수행할 수 있는 아침 시간에 진행하니, 그 효율은 극대화될 수밖에 없습니다.",
        "details": [
          {
            "subtitle": "주력 훈련 (80%): 고반복 웨이트로 근육의 밀도를 높여라",
            "text": "12~20회 반복 가능한 무게로 설정하여 근육이 타는 듯한 자극을 주는 '근지구력' 훈련에 집중하세요. 이는 당신의 지근 섬유를 효과적으로 자극하여 근육의 밀도와 선명도를 높이는 가장 좋은 방법입니다. 맨몸 운동, 서킷 트레이닝, 비교적 가벼운 무게의 머신 운동을 활용하여 전신을 골고루 자극하는 것이 좋습니다."
          },
          {
            "subtitle": "보조 훈련 (20%): 유산소로 근육을 돋보이게 하라",
            "text": "당신의 강점인 중강도 유산소 운동을 주 1~2회 추가하여 체지방을 관리하세요. 이 훈련의 목적은 주력 훈련으로 다져진 근육이 더 선명하게 드러나도록 하고, 심폐 기능을 건강하게 유지하는 것입니다."
          },
          {
            "subtitle": "운동 시간 및 회복 전략",
            "text": "독수리가 아침에 사냥하듯, 당신의 운동 골든타임은 오전입니다. 에어로빅형(A)은 회복이 빠른 편이므로 주 3~5회의 높은 빈도로 훈련할 수 있습니다. 회복기에는 근육의 재료인 단백질을 체중 1kg당 1.2~1.6g 수준으로 섭취하는 것이 중요합니다. 파워형에 비해 근육이 크는 속도는 더딜 수 있으니, 인내심을 갖고 꾸준히 훈련하는 자세가 성공의 열쇠입니다."
          }
        ]
      },
      {
        "category": "식단",
        "categoryIcon": "🥗",
        "title": "사냥꾼의 에너지원",
        "content": "선명한 근육질 몸매를 위해서는 '무엇을 먹는가'가 매우 중요합니다. 당신의 장(B)과 근육(A)의 특성을 모두 고려한 식단이 필요합니다.",
        "synergy": "당신의 식단 시너지는 '탄탄한 몸을 위한 단백질의 필요성(A)'과 '그 단백질을 효율적으로 사용하는 능력(B)'의 전략적 조합입니다. 당신의 몸은 근육의 선명도를 위해 충분한 단백질을 필요로 하며, 당신의 장은 그 단백질을 효율적으로 소화시킬 준비가 되어 있습니다. 따라서 '단백질 중심, 전략적 탄수화물' 식단을 통해, 당신은 다른 타입보다 쉽게 근육을 유지하며 체지방을 관리하는, 즉 '멋진 몸매'를 위한 이상적인 식단을 구성할 수 있습니다.",
        "details": [
          {
            "subtitle": "의식적인 단백질 섭취",
            "text": "근육의 재료가 부족하지 않도록 체중 1kg당 1.2~1.6g의 단백질을 의식적으로 챙겨 먹는 노력이 반드시 필요합니다. 평소 식사는 연어, 닭고기, 두부 같은 양질의 단백질과 건강한 지방을 중심으로 구성하세요."
          },
          {
            "subtitle": "전략적 탄수화물 섭취",
            "text": "탄수화물은 운동 에너지원으로 필요하지만, 과도하게 섭취하면 체지방으로 축적되어 근육의 선명도를 해칠 수 있습니다. 필요한 만큼의 탄수화물은 운동 전후에 집중적으로 배치하고, 그 외 시간에는 섭취를 줄이는 전략이 효과적입니다."
          },
          {
            "subtitle": "B타입 맞춤 영양",
            "text": "Bacteroides형(B)으로서, 운동 후 회복기에는 단백질과 더불어 장 건강을 위한 영양소를 함께 섭취하는 것이 좋습니다. 프로바이오틱스(요거트 등)나 오메가-3가 풍부한 식품은 장내 염증을 관리하고 회복의 질을 높이는 데 도움을 줄 수 있습니다."
          }
        ]
      },
      {
        "category": "정신건강 & 라이프스타일",
        "categoryIcon": "🧠",
        "title": "바람을 지배하는 평정심",
        "content": "당신은 선천적으로 높은 곳에서 평온함을 유지하는 능력을 지녔습니다. 이 '평정심(Calm)'을 유지하고 활용하는 것이 당신의 삶을 풍요롭게 만듭니다.",
        "synergy": "당신의 삶의 시너지는 '계획적인 아침(E)'과 '목표를 향한 꾸준함(C)'의 조화입니다. 스트레스에 강한 당신의 기질은 아침의 높은 생산성을 온전히 지켜줍니다. 특히 인내심이 중요한 에어로빅형(A)인 당신에게, 아침에 차분하게 그날의 운동과 일과를 계획하는 습관은 목표를 향한 긴 여정에서 길을 잃지 않게 해주는 가장 든든한 나침반이 되어줄 것입니다.",
        "details": [
          {
            "subtitle": "인내심과 꾸준함",
            "text": "당신의 몸은 빠르게 변하지 않을 수 있습니다. 하지만 당신의 차분하고(C) 성실한 성격은 이러한 과정을 견뎌낼 힘을 줍니다. 단기적인 결과에 조급해하지 말고, 장기적인 관점에서 꾸준히 나아가는 당신의 강점을 믿으세요."
          },
          {
            "subtitle": "고요한 아침의 힘",
            "text": "아침형(E)의 맑은 정신과 차분형(C)의 안정감이 결합된 당신의 아침은, 그 누구도 따라올 수 없는 '골든타임'입니다. 이 시간에 하루를 계획하고 가장 중요한 업무를 처리하면, 스트레스 없이 하루를 주도할 수 있습니다."
          },
          {
            "subtitle": "점진적 과부하의 원칙",
            "text": "고반복 훈련이라도 항상 같은 무게에 머물러서는 안 됩니다. 20회를 채울 수 있게 되면 무게를 조금이라도 올려, 근육이 계속 성장할 이유를 만들어 주어야 합니다. 이러한 '점진적 과부하'는 당신의 꾸준함과 만났을 때 최고의 시너지를 냅니다."
          }
        ]
      }
    ],
    "summaryTable": [
      {
        "category": "정신건강",
        "strategy": "단기 변화에 조급해하지 말고, '인내심과 꾸준함'이라는 당신의 강점을 믿으세요."
      },
      {
        "category": "운동",
        "strategy": "오전에 고반복(12~20회) 웨이트(80%)와 중강도 유산소(20%)를 조합하여 훈련하세요."
      },
      {
        "category": "식단",
        "strategy": "단백질(체중x1.2g 이상) 중심으로 식단을 구성하고, 탄수화물은 운동 전후에 전략적으로 섭취하세요."
      },
      {
        "category": "핵심",
        "strategy": "점진적 과부하를 잊지 마세요. 20회를 할 수 있게 되면, 다음엔 무게를 아주 조금이라도 올려야 합니다."
      }
    ],
    "closingMessage": "드넓은 하늘이 당신의 무대입니다. 당신의 고요한 집중력과 지치지 않는 지구력은 그 어떤 폭풍우도 넘어설 수 있는 힘입니다. 매일 아침 떠오르는 태양처럼, 당신의 가능성에는 한계가 없습니다."
  }
}