{
  "ECFA": {
    "title": "성실한 농부",
    "icon": "🌾",
    "summaryTitle": "The Diligent Farmer",
    "description": "당신은 이른 아침 밭을 일구는 성실한 농부와 같습니다. 자연의 순리를 이해하고, 서두르지 않는 침착함과 꾸준함으로 매일 씨앗을 심고 수확을 일궈냅니다. 당신의 힘은 땅에 깊이 뿌리내린 작물처럼 건강하고 근본적인 에너지에서 나옵니다. 화려하진 않지만, 그 어떤 비바람에도 흔들리지 않는 묵묵함이 당신의 가장 큰 무기입니다.",
    "analysis": {
      "E": "E (아침형 / Morning-Type): 당신의 신체 시계는 일찍 시작됩니다. 뇌와 신체 기능은 오전에 최고조에 달합니다.",
      "C": "C (차분형 / Calm-Type): 스트레스에 대한 회복탄력성이 높고, 감정적으로 안정된 성향을 가집니다.",
      "F": "F (식이섬유 친화형 / Fiber-Type): 당신의 장내미생물은 Prevotella가 우세할 가능성이 높습니다. 식이섬유와 복합 탄수화물을 에너지로 전환하는 능력이 뛰어납니다.",
      "A": "A (에어로빅형 / Aerobic-Type): 당신의 근육은 폭발적인 힘보다는 오랜 시간 지치지 않는 지구력에 특화되어 있으며, 근육의 밀도와 선명도를 높이는 데 강점이 있습니다."
    },
    "strategies": [
      {
        "category": "운동",
        "categoryIcon": "🏋️‍♂️",
        "title": "탄탄하고 선명한 몸매를 조각하라",
        "content": "당신은 에어로빅형(A)으로서, 거대한 근육보다는 지방이 적고 근육의 선명도가 높은 탄탄하고 밀도 있는 몸매를 만드는 데 최고의 잠재력을 가지고 있습니다.",
        "synergy": "당신의 운동 시너지는 '지치지 않는 지구력(A), 고요한 인내심(C), 그리고 마르지 않는 에너지(F)'의 완벽한 삼박자입니다. 당신은 남들보다 지치지 않고 더 오래 운동할 수 있으며(A), 그 과정을 지루해하지 않고 묵묵히 해낼 수 있는 정신력(C)을 가졌습니다. 여기에 식이섬유 친화형(F)으로서 섭취하는 복합 탄수화물은 당신의 운동을 위한 최고의 지속가능한 연료가 되어줍니다.",
        "details": [
          {
            "subtitle": "주력 훈련 (80%): 고반복 웨이트로 근육의 밀도를 높여라",
            "text": "12~20회 반복 가능한 무게로 설정하여 근육이 타는 듯한 자극을 주는 '근지구력' 훈련에 집중하세요. 이는 당신의 지근 섬유를 효과적으로 자극하여 근육의 밀도와 선명도를 높이는 가장 좋은 방법입니다. 맨몸 운동, 서킷 트레이닝, 비교적 가벼운 무게의 머신 운동을 활용하여 전신을 골고루 자극하는 것이 좋습니다."
          },
          {
            "subtitle": "보조 훈련 (20%): 유산소로 근육을 돋보이게 하라",
            "text": "당신의 강점인 중강도 유산소 운동을 주 1~2회 추가하여 체지방을 관리하세요. 이 훈련의 목적은 주력 훈련으로 다져진 근육이 더 선명하게 드러나도록 하고, 심폐 기능을 건강하게 유지하는 것입니다."
          },
          {
            "subtitle": "운동 시간 및 회복 전략",
            "text": "농부가 동틀 때 하루를 시작하듯, 당신의 운동 골든타임은 오전입니다. 에어로빅형(A)은 회복이 빠른 편이므로 주 3~5회의 높은 빈도로 훈련할 수 있습니다. 회복기에는 근육의 재료인 단백질을 체중 1kg당 1.2~1.6g 수준으로 섭취하는 것이 중요합니다."
          }
        ]
      },
      {
        "category": "식단",
        "categoryIcon": "🥗",
        "title": "땅이 주는 건강한 에너지",
        "content": "당신의 몸(A+F)은 자연 그대로의 건강한 에너지를 가장 사랑합니다. 당신의 식단 전략은 '자연주의' 그 자체입니다.",
        "synergy": "당신의 식단 시너지는 '지구력 운동의 에너지 요구(A)'와 '그 에너지를 가장 잘 만드는 장 환경(F)'의 이상적인 만남입니다. 당신의 몸은 장시간 운동을 위해 복합 탄수화물을 원하고, 당신의 장은 그 복합 탄수화물을 누구보다 효율적으로 분해하여 깨끗하고 안정적인 에너지로 만들어냅니다. 당신의 식단 자체가 당신의 운동 능력을 극대화하는 셈입니다.",
        "details": [
          {
            "subtitle": "고식이섬유 식단 유지",
            "text": "당신의 장(F)은 식이섬유를 분해하여 몸에 이로운 단쇄지방산을 만드는 능력이 뛰어납니다. 현미, 귀리, 콩류, 채소, 과일 등 섬유질이 풍부한 식단을 마음껏 즐기세요. 이는 지구력(A)의 원천인 복합 탄수화물을 공급하는 가장 좋은 방법이기도 합니다."
          },
          {
            "subtitle": "부족한 영양소 보충",
            "text": "채식 위주의 식단을 할 경우, 단백질과 일부 미네랄(철분, 비타민 B12)이 부족해질 수 있습니다. 매 끼니 콩, 두부, 렌틸콩을 포함시키고, 필요하다면 살코기나 생선을 추가하여 체중 1kg당 1.2~1.6g의 단백질과 미량 영양소 균형을 맞추는 것이 좋습니다."
          }
        ]
      },
      {
        "category": "정신건강 & 라이프스타일",
        "categoryIcon": "🧠",
        "title": "씨앗을 심는 마음",
        "content": "당신은 결과가 나오기까지 묵묵히 기다릴 줄 아는 '인내심'과 '평온함(Calm)'을 가졌습니다. 이 성향은 건강한 습관을 평생의 것으로 만드는 데 가장 큰 힘이 됩니다.",
        "synergy": "당신의 삶의 시너지는 '계획적인 아침(E)'과 '결과를 기다릴 줄 아는 인내심(C)'의 조화입니다. 스트레스에 강한 당신의 기질은 아침의 높은 생산성을 온전히 지켜줍니다. 특히 장기적인 관점이 중요한 농부와 같은 당신에게, 아침에 차분하게 그날의 운동과 일과를 계획하고 묵묵히 실천하는 습관은 서두르지 않고도 결국에는 풍성한 결실을 맺게 하는 가장 강력한 무기가 될 것입니다.",
        "details": [
          {
            "subtitle": "인내심과 꾸준함",
            "text": "파워형에 비해 근육이 크는 속도는 분명 더딜 것입니다. 하지만 당신의 차분하고(C) 성실한 성격은 이러한 과정을 견뎌낼 힘을 줍니다. 단기적인 결과에 조급해하지 말고, 장기적인 관점에서 꾸준히 나아가는 당신의 강점을 믿으세요."
          },
          {
            "subtitle": "점진적 과부하의 원칙",
            "text": "고반복 훈련이라도 항상 같은 무게에 머물러서는 안 됩니다. 20회를 채울 수 있게 되면 무게를 조금이라도 올려, 근육이 계속 성장할 이유를 만들어 주어야 합니다. 이러한 '점진적 과부하'는 당신의 꾸준함과 만났을 때 최고의 시너지를 냅니다."
          }
        ]
      }
    ],
    "summaryTable": [
      {
        "category": "정신건강",
        "strategy": "단기 변화에 조급해하지 말고, '인내심과 꾸준함'이라는 당신의 강점을 믿으세요."
      },
      {
        "category": "운동",
        "strategy": "오전에 고반복(12~20회) 웨이트(80%)와 중강도 유산소(20%)를 조합하여 훈련하세요."
      },
      {
        "category": "식단",
        "strategy": "고식이섬유 식단을 기본으로, 단백질(체중x1.2g 이상)과 미네랄을 충분히 보충하세요."
      },
      {
        "category": "핵심",
        "strategy": "점진적 과부하를 잊지 마세요. 20회를 할 수 있게 되면, 다음엔 무게를 아주 조금이라도 올려야 합니다."
      }
    ],
    "closingMessage": "좋은 열매는 하루아침에 열리지 않습니다. 매일 밭을 갈고 씨앗을 심는 농부의 성실함이 풍성한 수확을 약속하듯, 당신의 꾸준한 노력은 반드시 건강이라는 최고의 결실을 맺게 될 것입니다."
  }
}