{
  "EIBA": {
    "title": "협곡의 급류",
    "icon": "🏞️",
    "summaryTitle": "The Canyon Rapids",
    "description": "당신은 이른 아침, 좁은 협곡을 굽이치며 바다를 향해 나아가는 거침없는 급류와 같습니다. 당신의 내면에는 강렬한 열정과 멈추지 않는 에너지가 넘실거리며, 어떤 장애물도 우회하거나 뛰어넘어 결국 자신의 길을 만들어 냅니다. 당신의 힘은 단번에 모든 것을 부수는 것이 아닌, 지치지 않는 흐름으로 바위를 깎아내는 꾸준함에 있습니다.",
    "analysis": {
      "E": "E (아침형 / Morning-Type): 당신의 신체 시계는 일찍 시작됩니다. 뇌와 신체 기능은 오전에 최고조에 달합니다.",
      "I": "I (스트레스 민감형 / Intense-Type): 스트레스 상황에서 신체적, 감정적 반응이 크게 나타나는 편입니다. 이는 강력한 추진력의 원천이지만, 번아웃을 막기 위한 세심한 컨디션 관리가 필수적입니다.",
      "B": "B (Bacteroides형 / Bacteroides-Type): 당신의 장은 단백질과 지방을 소화하고 활용하는 데 최적화되어 있습니다.",
      "A": "A (에어로빅형 / Aerobic-Type): 당신의 근육은 폭발적인 힘보다는 오랜 시간 지치지 않는 지구력에 특화되어 있으며, 근육의 밀도와 선명도를 높이는 데 강점이 있습니다."
    },
    "strategies": [
      {
        "category": "운동",
        "categoryIcon": "🏋️‍♂️",
        "title": "탄탄하고 선명한 몸매를 조각하라",
        "content": "당신은 에어로빅형(A)으로서, 거대한 근육보다는 지방이 적고 근육의 선명도가 높은 탄탄하고 밀도 있는 몸매를 만드는 데 최고의 잠재력을 가지고 있습니다.",
        "synergy": "당신의 운동 시너지는 '아침의 강렬한 추진력(E+I)'과 '그것을 뒷받침하는 지치지 않는 심장(A)'의 결합입니다. 당신은 아침 일찍부터 목표를 향해 달려 나갈 뜨거운 열정(I)을 가졌고, 그 열정을 긴 시간 동안 지속시킬 수 있는 신체(A)를 가졌습니다. 이 둘의 결합은 당신을 멈추지 않는 '인간 급류'로 만들어, 어떤 힘든 유산소 훈련이나 고반복 훈련도 완수해낼 수 있게 합니다.",
        "details": [
          {
            "subtitle": "주력 훈련 (80%): 고반복 웨이트로 근육의 밀도를 높여라",
            "text": "12~20회 반복 가능한 무게로 설정하여 근육이 타는 듯한 자극을 주는 '근지구력' 훈련에 집중하세요. 이는 당신의 지근 섬유를 효과적으로 자극하여 근육의 밀도와 선명도를 높이는 가장 좋은 방법입니다. 맨몸 운동, 서킷 트레이닝, 비교적 가벼운 무게의 머신 운동을 활용하여 전신을 골고루 자극하는 것이 좋습니다."
          },
          {
            "subtitle": "보조 훈련 (20%): 유산소로 근육을 돋보이게 하라",
            "text": "당신의 강점인 중강도 유산소 운동을 주 1~2회 추가하여 체지방을 관리하세요. 이 훈련의 목적은 주력 훈련으로 다져진 근육이 더 선명하게 드러나도록 하고, 심폐 기능을 건강하게 유지하는 것입니다."
          },
          {
            "subtitle": "운동 시간 및 회복 전략",
            "text": "당신의 운동 골든타임은 오전입니다. 에어로빅형(A)으로서 회복이 빠른 편이므로 주 3~5회의 높은 빈도로 훈련할 수 있습니다. 하지만 스트레스 민감형(I)으로서, 정신적 스트레스가 심한 날에는 과감히 훈련 강도를 낮추거나 휴식을 취하는 유연성이 필요합니다."
          }
        ]
      },
      {
        "category": "식단",
        "categoryIcon": "🥗",
        "title": "급류의 에너지원",
        "content": "선명한 근육질 몸매를 위해서는 '무엇을 먹는가'가 매우 중요합니다. 특히 스트레스(I)로 인한 컨디션 난조를 막기 위해, 당신의 장(B)에 맞는 식단이 필요합니다.",
        "synergy": "당신의 식단 시너지는 '선명한 몸매를 위한 단백질의 필요성(A)'과 '단백질 소화에 특화된 장(B)', 그리고 '혈당 안정이 필수적인 민감성(I)'의 만남입니다. 당신은 근육의 선명도를 지키기 위해 단백질이 꼭 필요하며(A), 이를 효율적으로 소화시킬 수 있습니다(B). 동시에, 단백질/지방 중심의 식단은 당신의 예민한 기분(I)을 좌우하는 혈당을 안정적으로 유지하는 데 큰 도움이 됩니다. 이는 몸과 마음을 동시에 안정시키는 이상적인 식단 전략입니다.",
        "details": [
          {
            "subtitle": "의식적인 단백질 섭취",
            "text": "근육의 재료가 부족하지 않도록 체중 1kg당 1.2~1.6g의 단백질을 의식적으로 챙겨 먹는 노력이 반드시 필요합니다. 평소 식사는 연어, 닭고기, 두부 같은 양질의 단백질과 건강한 지방을 중심으로 구성하세요."
          },
          {
            "subtitle": "전략적 탄수화물 섭취",
            "text": "탄수화물은 운동 에너지원으로 필요하지만, 과도하게 섭취하면 체지방으로 축적되어 근육의 선명도를 해칠 수 있습니다. 필요한 만큼의 탄수화물은 운동 전후에 집중적으로 배치하고, 그 외 시간에는 섭취를 줄이는 전략이 효과적입니다."
          }
        ]
      },
      {
        "category": "정신건강 & 라이프스타일",
        "categoryIcon": "🧠",
        "title": "강물의 길을 터주는 지혜",
        "content": "당신의 강렬한(I) 에너지는 강물과 같아서, 길을 터주지 않으면 범람하여 스스로를 힘들게 할 수 있습니다. '규칙'과 '루틴'이라는 튼튼한 강둑을 쌓는 것이 핵심입니다.",
        "synergy": "당신의 삶의 시너지는 '새롭게 시작하는 아침(E)'과 '그 아침을 채우는 뜨거운 열정(I)'의 만남입니다. 당신의 아침은 누구보다 강렬하고 생산적일 수 있는 '기회의 시간'입니다. 하지만 동시에, 관리되지 않은 열정은 아침부터 불안과 조급함으로 변질될 수 있습니다. 당신의 하루는 '아침 1시간'을 어떻게 사용하느냐에 따라 극적으로 달라질 수 있습니다.",
        "details": [
          {
            "subtitle": "아침 루틴이라는 강둑",
            "text": "당신의 하루는 아침(E)에 결정됩니다. 매일 같은 시간에 일어나 햇볕을 쬐고, 가벼운 스트레칭과 건강한 아침 식사로 이어지는 '아침 루틴'을 만드세요. 이 단단한 루틴은 당신의 하루가 스트레스(I)에 휩쓸리지 않도록 지켜주는 가장 중요한 강둑이 될 것입니다."
          },
          {
            "subtitle": "의식적인 휴식",
            "text": "강물도 쉴 때가 있듯, 당신에게는 의식적인 휴식이 반드시 필요합니다. 스트레스가 심한 날에는 '쉬는 것도 전략'이라고 생각하세요. 운동을 쉬고, 좋아하는 차를 마시거나 조용한 음악을 듣는 등 신경계를 완전히 이완시키는 시간을 갖는 것이 장기적으로는 더 멀리 나아가는 길입니다."
          }
        ]
      }
    ],
    "summaryTable": [
      {
        "category": "정신건강",
        "strategy": "'아침 루틴'이라는 단단한 강둑을 쌓아, 당신의 강렬한 에너지가 범람하지 않도록 관리하세요."
      },
      {
        "category": "운동",
        "strategy": "오전에 고반복(12~20회) 웨이트(80%)와 중강도 유산소(20%)를 조합하되, 컨디션에 따라 강도를 조절하세요."
      },
      {
        "category": "식단",
        "strategy": "단백질(체중x1.2g 이상) 중심으로 식단을 구성하고, 탄수화물은 운동 전후에 전략적으로 섭취하세요."
      },
      {
        "category": "핵심",
        "strategy": "컨디션이 나쁜 날에는 쉬는 용기가 당신의 꾸준함을 지켜주는 최고의 지혜입니다."
      }
    ],
    "closingMessage": "당신의 열정은 바위를 뚫는 힘을 가졌습니다. 그 흐름을 막으려 하지 말고, 단단한 길을 터주어 바다로 향하게 하세요. 당신의 지치지 않는 에너지는 결국 세상을 바꾸는 거대한 강물이 될 것입니다."
  }
}