{
  "EIFA": {
    "title": "새벽의 탐험가",
    "icon": "🧭",
    "summaryTitle": "The Dawn Explorer",
    "description": "당신은 새벽의 첫 빛을 따라 미지의 세계로 나서는 탐험가와 같습니다. 당신의 내면에는 새로운 것을 발견하려는 뜨거운 열정과, 어떤 긴 여정도 완주해 낼 수 있는 지치지 않는 심장이 있습니다. 당신은 자연에서 얻는 깨끗한 에너지를 연료 삼아, 예리하고 섬세한 감각으로 세상의 숨겨진 길을 찾아 나섭니다.",
    "analysis": {
      "E": "E (아침형 / Morning-Type): 당신의 신체 시계는 일찍 시작됩니다. 뇌와 신체 기능은 오전에 최고조에 달합니다.",
      "I": "I (스트레스 민감형 / Intense-Type): 스트레스 상황에서 신체적, 감정적 반응이 크게 나타나는 편입니다. 이는 강력한 추진력의 원천이지만, 번아웃을 막기 위한 세심한 컨디션 관리가 필수적입니다.",
      "F": "F (식이섬유 친화형 / Fiber-Type): 당신의 장내미생물은 Prevotella가 우세할 가능성이 높습니다. 식이섬유와 복합 탄수화물을 에너지로 전환하는 능력이 뛰어납니다.",
      "A": "A (에어로빅형 / Aerobic-Type): 당신의 근육은 폭발적인 힘보다는 오랜 시간 지치지 않는 지구력에 특화되어 있으며, 근육의 밀도와 선명도를 높이는 데 강점이 있습니다."
    },
    "strategies": [
      {
        "category": "운동",
        "categoryIcon": "🏋️‍♂️",
        "title": "탄탄하고 선명한 몸매를 조각하라",
        "content": "당신은 에어로빅형(A)으로서, 거대한 근육보다는 지방이 적고 근육의 선명도가 높은 탄탄하고 밀도 있는 몸매를 만드는 데 최고의 잠재력을 가지고 있습니다.",
        "synergy": "당신의 운동 시너지는 '아침의 강렬한 추진력(E+I)'과 '그것을 뒷받침하는 지치지 않는 심장(A) 및 마르지 않는 에너지원(F)'의 완벽한 조화입니다. 당신은 아침 일찍부터 목표를 향해 달려 나갈 뜨거운 열정(I)과 체력(A)을 가졌으며, 식이섬유 친화적인 장(F)은 이 여정을 위한 최고의 지속가능한 연료를 공급합니다. 이 모든 것이 결합되어 당신을 그 어떤 긴 여정도 완수해낼 수 있는 '궁극의 탐험가'로 만듭니다.",
        "details": [
          {
            "subtitle": "주력 훈련 (80%): 고반복 웨이트로 근육의 밀도를 높여라",
            "text": "12~20회 반복 가능한 무게로 설정하여 근육이 타는 듯한 자극을 주는 '근지구력' 훈련에 집중하세요. 이는 당신의 지근 섬유를 효과적으로 자극하여 근육의 밀도와 선명도를 높이는 가장 좋은 방법입니다. 맨몸 운동, 서킷 트레이닝, 비교적 가벼운 무게의 머신 운동을 활용하여 전신을 골고루 자극하는 것이 좋습니다."
          },
          {
            "subtitle": "보조 훈련 (20%): 유산소로 근육을 돋보이게 하라",
            "text": "당신의 강점인 중강도 유산소 운동을 주 1~2회 추가하여 체지방을 관리하세요. 이 훈련의 목적은 주력 훈련으로 다져진 근육이 더 선명하게 드러나도록 하고, 심폐 기능을 건강하게 유지하는 것입니다."
          },
          {
            "subtitle": "운동 시간 및 회복 전략",
            "text": "탐험가는 동틀 녘에 여정을 시작합니다. 당신의 운동 골든타임은 오전입니다. 에어로빅형(A)으로서 회복이 빠른 편이므로 주 3~5회의 높은 빈도로 훈련할 수 있습니다. 하지만 스트레스 민감형(I)으로서, 정신적 스트레스가 심한 날에는 과감히 훈련 강도를 낮추거나 휴식을 취하는 유연성이 필요합니다."
          }
        ]
      },
      {
        "category": "식단",
        "categoryIcon": "🥗",
        "title": "탐험가의 비상식량",
        "content": "당신의 몸(A+F)은 자연 그대로의 깨끗한 에너지를 가장 효율적으로 사용합니다. 특히 스트레스(I) 관리를 위해, 안정적인 에너지 공급이 중요합니다.",
        "synergy": "당신의 식단 시너지는 '지구력 운동의 에너지 요구(A)'와 '그 에너지를 가장 잘 만드는 장 환경(F)', 그리고 '안정이 필요한 민감한 신경계(I)'의 이상적인 만남입니다. 당신의 장(F)은 장시간 운동(A)에 필요한 안정적인 에너지를 공급할 뿐 아니라, 그 과정에서 만들어지는 유익한 대사산물들이 '장-뇌 축'을 통해 당신의 예민한 신경계(I)를 안정시키는 데 도움을 줄 수 있습니다. 즉, 당신의 식단은 몸과 마음 모두를 위한 '치유의 음식'이 될 수 있습니다.",
        "details": [
          {
            "subtitle": "고식이섬유, 복합 탄수화물 중심 식단",
            "text": "당신의 장(F)과 근육(A) 모두가 사랑하는 식단입니다. 현미, 귀리, 통밀빵, 고구마, 콩류, 채소, 과일 등을 식단의 중심으로 삼으세요. 이는 당신의 긴 여정을 위한 안정적인 에너지가 되어줄 뿐 아니라, 스트레스 민감형(I)에게 필수적인 혈당 안정에도 크게 기여합니다."
          },
          {
            "subtitle": "의식적인 단백질 섭취",
            "text": "탄탄한 몸매를 위해 근육의 재료가 부족하지 않도록, 체중 1kg당 1.2~1.6g의 단백질을 의식적으로 챙겨 먹는 노력이 반드시 필요합니다. 두부, 콩류 등 식물성 단백질을 적극 활용하고, 필요시 생선이나 닭가슴살을 추가하는 것이 좋습니다."
          }
        ]
      },
      {
        "category": "정신건강 & 라이프스타일",
        "categoryIcon": "🧠",
        "title": "나만의 지도를 그리는 법",
        "content": "당신의 강렬한(I) 열정은 위대한 발견을 위한 동력이지만, 때로는 길을 잃게 만들 수도 있습니다. '나만의 지도(루틴)'를 만들어 꾸준히 나아가는 것이 핵심입니다.",
        "synergy": "당신의 삶의 시너지는 '새롭게 시작하는 아침(E)'과 '그 아침을 채우는 뜨거운 열정(I)'의 만남입니다. 당신의 아침은 누구보다 강렬하고 생산적일 수 있는 '기회의 시간'입니다. 하지만 동시에, 관리되지 않은 열정은 아침부터 불안과 조급함으로 변질될 수 있습니다. 당신의 하루는 '아침 1시간'을 어떻게 사용하느냐에 따라 극적으로 달라질 수 있습니다.",
        "details": [
          {
            "subtitle": "아침 루틴이라는 강둑",
            "text": "당신의 하루는 아침(E)에 결정됩니다. 매일 같은 시간에 일어나 햇볕을 쬐고, 가벼운 스트레칭과 건강한 아침 식사로 이어지는 '아침 루틴'을 만드세요. 이 단단한 루틴은 당신의 하루가 스트레스(I)에 휩쓸리지 않도록 지켜주는 가장 중요한 강둑이 될 것입니다."
          },
          {
            "subtitle": "의식적인 휴식",
            "text": "탐험가도 베이스캠프에서 휴식을 취합니다. 스트레스가 심한 날에는 과감히 모든 것을 멈추고 의식적인 이완에 집중하세요. 명상, 심호흡, 자연 속에서의 산책 등은 당신의 과열된 나침반을 재조정하고, 다음 여정을 위한 에너지를 채워줄 것입니다."
          }
        ]
      }
    ],
    "summaryTable": [
      {
        "category": "정신건강",
        "strategy": "아침 루틴을 통해 강렬한 에너지를 관리하고, 구체적인 목표로 열정에 방향을 제시하세요."
      },
      {
        "category": "운동",
        "strategy": "오전에 고반복(12~20회) 웨이트(80%)와 중강도 유산소(20%)를 조합하되, 컨디션에 따라 강도를 조절하세요."
      },
      {
        "category": "식단",
        "strategy": "고식이섬유, 복합 탄수화물 중심의 식단으로 몸과 마음의 안정을 찾으세요."
      },
      {
        "category": "핵심",
        "strategy": "컨디션이 좋지 않을 때 쉬어가는 것이 더 멀리 가기 위한 탐험가의 지혜입니다."
      }
    ],
    "closingMessage": "당신의 예리한 감각과 지치지 않는 열정은 아직 발견되지 않은 길을 찾아내는 특별한 재능입니다. 당신의 심장이 이끄는 대로 꾸준히 나아가다 보면, 어느새 당신은 세상의 가장 멋진 풍경 앞에 서 있게 될 것입니다."
  }
}