{
  "OIBA": {
    "title": "지치지 않는 추격자",
    "icon": "🐺",
    "summaryTitle": "The Tireless Pursuer",
    "description": "당신은 어둠이 내린 광야를 가로지르며, 목표물을 향해 지치지 않고 달려가는 추격자와 같습니다. 세상이 잠들고 고요해질 때, 당신의 감각은 가장 예리해지고 내면의 에너지는 뜨겁게 타오릅니다. 당신의 힘은 한 번의 강력한 공격이 아닌, 누구도 따라올 수 없는 끈기와 집요함으로 상대를 지치게 만드는 지구력에 있습니다.",
    "analysis": {
      "O": "O (저녁형 / Evening-Type): 당신의 신체 시계는 늦게 시작됩니다. 뇌와 신체 기능은 늦은 오후나 저녁에 최고조에 달합니다.",
      "I": "I (스트레스 민감형 / Intense-Type): 스트레스 상황에서 신체적, 감정적 반응이 크게 나타나는 편입니다. 이는 강력한 추진력의 원천이지만, 번아웃을 막기 위한 세심한 컨디션 관리가 필수적입니다.",
      "B": "B (Bacteroides형 / Bacteroides-Type): 당신의 장은 단백질과 지방을 소화하고 활용하는 데 최적화되어 있습니다.",
      "A": "A (에어로빅형 / Aerobic-Type): 당신의 근육은 폭발적인 힘보다는 오랜 시간 지치지 않는 지구력에 특화되어 있으며, 근육의 밀도와 선명도를 높이는 데 강점이 있습니다."
    },
    "strategies": [
      {
        "category": "운동",
        "categoryIcon": "🏋️‍♂️",
        "title": "탄탄하고 선명한 몸매를 조각하라",
        "content": "당신은 에어로빅형(A)으로서, 거대한 근육보다는 지방이 적고 근육의 선명도가 높은 탄탄하고 밀도 있는 몸매를 만드는 데 최고의 잠재력을 가지고 있습니다.",
        "synergy": "당신의 운동 시너지는 '밤에 깨어나는 지치지 않는 심장(O+A)'과 '그것을 한계까지 밀어붙이는 강렬한 정신력(I)'의 결합입니다. 대부분의 사람들이 지쳐갈 때 당신의 진짜 힘이 발휘됩니다(O+A). 여기에 당신의 강렬한 성향(I)은 '이만하면 됐다'는 안주 대신, 자신의 한계를 시험하고 넘어서려는 강한 동기를 부여합니다. 당신의 훈련은 단순한 운동이 아니라, 스스로의 한계를 추격하는 과정입니다.",
        "details": [
          {
            "subtitle": "주력 훈련 (80%): 고반복 웨이트로 근육의 밀도를 높여라",
            "text": "12~20회 반복 가능한 무게로 설정하여 근육이 타는 듯한 자극을 주는 '근지구력' 훈련에 집중하세요. 이는 당신의 지근 섬유를 효과적으로 자극하여 근육의 밀도와 선명도를 높이는 가장 좋은 방법입니다. 맨몸 운동, 서킷 트레이닝, 비교적 가벼운 무게의 머신 운동을 활용하여 전신을 골고루 자극하는 것이 좋습니다."
          },
          {
            "subtitle": "보조 훈련 (20%): 유산소로 근육을 돋보이게 하라",
            "text": "당신의 강점인 중강도 유산소 운동을 주 1~2회 추가하여 체지방을 관리하세요. 이 훈련의 목적은 주력 훈련으로 다져진 근육이 더 선명하게 드러나도록 하고, 심폐 기능을 건강하게 유지하는 것입니다."
          },
          {
            "subtitle": "운동 시간 및 회복 전략",
            "text": "저녁형(O)으로서 당신의 골든타임은 늦은 오후나 저녁입니다. 에어로빅형(A)으로서 회복이 빠른 편이므로 주 3~5회의 높은 빈도로 훈련할 수 있습니다. 하지만 스트레스 민감형(I)으로서, 정신적 스트레스가 심한 날에는 과감히 훈련 강도를 낮추거나 휴식을 취하는 유연성이 필요합니다."
          }
        ]
      },
      {
        "category": "식단",
        "categoryIcon": "🥗",
        "title": "추적자의 에너지원",
        "content": "선명한 근육질 몸매를 위해서는 '무엇을 먹는가'가 매우 중요합니다. 특히 스트레스(I)로 인한 컨디션 난조를 막기 위해, 당신의 장(B)에 맞는 식단이 필요합니다.",
        "synergy": "당신의 식단 시너지는 '선명한 몸매를 위한 단백질의 필요성(A)', '그것을 효율적으로 사용하는 능력(B)', 그리고 '혈당 안정이 필수적인 민감성(I)'의 만남입니다. 당신은 근육의 선명도를 지키기 위해 단백질이 꼭 필요하며(A), 이를 효율적으로 소화시킬 수 있습니다(B). 무엇보다, 당신의 예민한 기분(I)을 좌우하는 혈당을 안정적으로 유지하는 데 단백질/지방 중심의 식단이 큰 도움이 됩니다. 이는 몸과 마음을 동시에 안정시키는 이상적인 식단 전략입니다.",
        "details": [
          {
            "subtitle": "의식적인 단백질 섭취",
            "text": "근육의 재료가 부족하지 않도록 체중 1kg당 1.2~1.6g의 단백질을 의식적으로 챙겨 먹는 노력이 반드시 필요합니다. 평소 식사는 연어, 닭고기, 두부 같은 양질의 단백질과 건강한 지방을 중심으로 구성하세요."
          },
          {
            "subtitle": "전략적 탄수화물 섭취",
            "text": "탄수화물은 운동 에너지원으로 필요하지만, 과도하게 섭취하면 체지방으로 축적되어 근육의 선명도를 해칠 수 있습니다. 필요한 만큼의 탄수화물은 운동 전후에 집중적으로 배치하고, 그 외 시간에는 섭취를 줄이는 전략이 효과적입니다."
          }
        ]
      },
      {
        "category": "정신건강 & 라이프스타일",
        "categoryIcon": "🧠",
        "title": "열정을 지혜롭게 이끄는 법",
        "content": "당신의 '강렬함(Intense)'은 양날의 검입니다. 위대한 성취를 위한 동력이 되기도 하지만, 스스로를 소진시킬 수도 있습니다. 핵심은 '전력 질주'와 '완전한 멈춤'을 의식적으로 조절하는 것입니다.",
        "synergy": "당신의 삶의 시너지는 '깊은 밤의 집중력(O)'과 '그 시간을 채우는 뜨거운 열정(I)'의 만남입니다. 당신의 밤은 누구보다 강렬하고 생산적일 수 있는 '기회의 시간'입니다. 하지만 동시에, 관리되지 않은 열정은 조급함과 불안으로 변질될 수 있습니다. 당신의 성공은 당신의 밤을 어떻게 활용하느냐에 달려있습니다.",
        "details": [
          {
            "subtitle": "'ON/OFF' 스위치를 명확히",
            "text": "당신은 한번 몰입하면 끝을 보는 스타일입니다. 당신의 골든타임인 저녁에 열정을 모두 쏟아부어 집중하고, 일이 끝나거나 운동이 끝나면 의식적으로 'OFF' 스위치를 누르세요. 운동 후 명상, 심호흡, 가벼운 산책 등은 과열된 신경계를 진정시키는 데 필수적입니다."
          },
          {
            "subtitle": "과도한 자극 피하기",
            "text": "스트레스에 민감(I)하므로, 불필요한 자극은 피하는 것이 좋습니다. 특히 수면의 질을 위해, 저녁 늦게까지 강한 빛(스마트폰 등)에 노출되는 것을 피하고 차분한 환경을 조성하여 당신의 늦은 수면 시간을 보호해야 합니다."
          }
        ]
      }
    ],
    "summaryTable": [
      {
        "category": "정신건강",
        "strategy": "일과 휴식의 'ON/OFF'를 명확히 하여, 번아웃을 예방하고 당신의 밤을 지배하세요."
      },
      {
        "category": "운동",
        "strategy": "저녁에 고반복(12~20회) 웨이트(80%)와 중강도 유산소(20%)를 조합하되, 컨디션에 따라 강도를 조절하세요."
      },
      {
        "category": "식단",
        "strategy": "단백질(체중x1.2g 이상) 중심으로 식단을 구성하고, 탄수화물은 운동 전후에 전략적으로 섭취하세요."
      },
      {
        "category": "핵심",
        "strategy": "컨디션이 나쁜 날에는 쉬는 용기가 당신의 꾸준함을 지켜주는 최고의 지혜입니다."
      }
    ],
    "closingMessage": "당신의 집요함은 결국 당신을 원하는 곳으로 이끌 것입니다. 지치지 않는 추격자여, 당신의 페이스대로 밤의 광야를 달려나가세요."
  }
}