{
  "OIBP": {
    "title": "미드나잇 워리어",
    "icon": "⚡",
    "summaryTitle": "The Midnight Warrior",
    "description": "당신은 모두가 잠든 깊은 밤, 홀로 깨어 자신과의 싸움을 준비하는 전사와 같습니다. 당신의 내면에는 뜨거운 열정과 강력한 에너지가 용암처럼 들끓고 있으며, 이는 한계를 넘어서는 폭발적인 힘의 원천이 됩니다. 세상이 고요해질 때 당신의 정신은 가장 날카로워지며, 이 밤의 전장에서 당신은 가장 강력한 존재가 됩니다.",
    "analysis": {
      "O": "O (저녁형 / Evening-Type): 당신의 신체 시계는 늦게 시작됩니다. 뇌와 신체 기능은 늦은 오후나 저녁에 최고조에 달합니다.",
      "I": "I (스트레스 민감형 / Intense-Type): 스트레스 상황에서 신체적, 감정적 반응이 크게 나타나는 편입니다. 이는 강력한 추진력의 원천이지만, 번아웃을 막기 위한 세심한 컨디션 관리가 필수적입니다.",
      "B": "B (Bacteroides형 / Bacteroides-Type): 당신의 장은 단백질과 지방을 소화하고 활용하는 데 최적화되어 있습니다.",
      "P": "P (파워형 / Power-Type): 당신의 근육은 순간적인 힘과 스피드를 내는 데 유리하며, 근육 성장의 잠재력이 매우 높습니다."
    },
    "strategies": [
      {
        "category": "운동",
        "categoryIcon": "🏋️‍♂️",
        "title": "잠재력을 폭발시켜 웅장한 몸을 빚어라",
        "content": "당신은 파워형(P)으로서, 근육 성장의 잠재력이 매우 높습니다. 당신의 목표는 이 잠재력을 폭발시켜 크고 웅장한 몸매를 만드는 것입니다.",
        "synergy": "당신의 운동 시너지는 '밤에 깨어나는 폭발적인 힘(O+P)'과 '그 힘을 증폭시키는 강렬한 열정(I)'의 만남입니다. 대부분의 사람들이 지쳐가는 저녁 시간, 당신의 몸과 마음은 오히려 가장 뜨겁게 타오릅니다. 당신의 강렬한 성향(I)은 고중량 훈련(P)의 한계를 넘어서는 '투쟁 본능'을 자극하여, 다른 타입이 흉내 낼 수 없는 폭발적인 퍼포먼스를 가능하게 합니다. 당신의 훈련은 단순한 운동이 아닌, 전사의 전투와 같습니다.",
        "details": [
          {
            "subtitle": "주력 훈련 (80%): 고중량 웨이트로 근육을 조각하라",
            "text": "근비대에 가장 효과적인 6~12회 반복 가능한 무게를 기본으로 하되, 근력 강화를 위해 주기적으로 4~8회의 고중량 훈련을 병행하는 것이 좋습니다. 스쿼트, 데드리프트, 벤치프레스 등 복합관절 운동을 훈련의 중심으로 삼으세요."
          },
          {
            "subtitle": "보조 훈련 (20%): 컨디셔닝으로 성장을 지원하라",
            "text": "주 1~2회, 20~30분 내외의 가벼운 유산소 운동(걷기, 사이클 등)을 추가하세요. 이 훈련의 목적은 근육을 키우는 것이 아니라, 주력 훈련의 피로를 풀고 심폐 건강을 유지하기 위함입니다. 지나친 유산소 운동은 근성장을 방해할 수 있으므로 강도와 시간을 제한하는 것이 중요합니다."
          },
          {
            "subtitle": "운동 시간 및 회복 전략",
            "text": "저녁형(O)으로서 당신의 골든타임은 늦은 오후나 저녁입니다. 근육군당 최소 48시간의 회복 시간이 필수적이므로, '가슴/등/하체' 같은 분할 훈련이 매우 효과적입니다. 스트레스 민감형(I)으로서 당신의 회복은 '선택'이 아닌 '필수'입니다. 정신적 스트레스가 심한 날에는 과감히 훈련 강도를 낮추거나 휴식을 취하는 유연성이 필요합니다."
          }
        ]
      },
      {
        "category": "식단",
        "categoryIcon": "🥗",
        "title": "전사의 연료",
        "content": "당신의 폭발적인 에너지(P)는 안정적이고 꾸준한 연료 공급을 필요로 합니다. 특히 스트레스(I)로 인한 혈당 변동은 당신의 컨디션을 크게 좌우합니다.",
        "synergy": "당신의 식단 시너지는 '근육의 높은 단백질 요구(P)'와 '그것을 효율적으로 처리하는 장(B)', 그리고 '스트레스가 변수가 되는 민감성(I)'의 복합적인 관계입니다. 당신은 근성장을 위해 단백질을 섭취하면 남들보다 빠르게 효과를 볼 수 있는 이상적인 조합(P+B)을 가졌습니다. 하지만 스트레스(I) 관리가 되지 않으면, 이 모든 시스템이 무너지고 '스트레스성 폭식'으로 이어질 수 있습니다. 따라서 당신의 식단은 근육뿐 아니라 '정신'을 위한 것이기도 합니다.",
        "details": [
          {
            "subtitle": "고단백 식단과 혈당 안정",
            "text": "당신의 목표 달성을 위해 체중 1kg당 1.6~2.0g의 단백질 섭취는 타협할 수 없는 원칙입니다. 여기에 스트레스 민감형(I)으로서 혈당을 안정시키는 것이 중요합니다. 정제 탄수화물을 줄이고, 매 끼니 단백질과 건강한 지방, 소량의 복합 탄수화물을 함께 섭취하세요."
          },
          {
            "subtitle": "저녁형 맞춤 식사 패턴",
            "text": "아침에 식욕이 없다면 억지로 먹을 필요는 없습니다. 대신 '16:8 간헐적 단식'처럼 점심부터 저녁까지 식사 시간을 정해두고, 그 시간 안에 필요한 영양소를 모두 섭취하는 전략이 효과적일 수 있습니다. 이는 저녁형(O)의 식사 패턴과 잘 맞으면서 야식을 방지하는 효과가 있습니다."
          }
        ]
      },
      {
        "category": "정신건강 & 라이프스타일",
        "categoryIcon": "🧠",
        "title": "열정을 지혜롭게 이끄는 법",
        "content": "당신의 '강렬함(Intense)'은 양날의 검입니다. 위대한 성취를 위한 동력이 되기도 하지만, 스스로를 소진시킬 수도 있습니다. 핵심은 '전력 질주'와 '완전한 멈춤'을 의식적으로 조절하는 것입니다.",
        "synergy": "당신의 삶의 시너지는 '깊은 밤의 집중력(O)'과 '그 시간을 채우는 뜨거운 열정(I)'의 만남입니다. 당신의 밤은 누구보다 강렬하고 생산적일 수 있는 '기회의 시간'입니다. 하지만 동시에, 관리되지 않은 열정은 조급함과 불안으로 변질될 수 있습니다. 당신의 성공은 당신의 밤을 어떻게 활용하느냐에 달려있습니다.",
        "details": [
          {
            "subtitle": "'ON/OFF' 스위치를 명확히",
            "text": "당신은 한번 몰입하면 끝을 보는 스타일입니다. 당신의 골든타임인 저녁에 열정을 모두 쏟아부어 집중하고, 일이 끝나거나 운동이 끝나면 의식적으로 'OFF' 스위치를 누르세요. 운동 후 명상, 심호흡, 가벼운 산책 등은 과열된 신경계를 진정시키는 데 필수적입니다."
          },
          {
            "subtitle": "과도한 자극 피하기",
            "text": "스트레스에 민감(I)하므로, 불필요한 자극은 피하는 것이 좋습니다. 특히 수면의 질을 위해, 저녁 늦게까지 강한 빛(스마트폰 등)에 노출되는 것을 피하고 차분한 환경을 조성하여 당신의 늦은 수면 시간을 보호해야 합니다."
          }
        ]
      }
    ],
    "summaryTable": [
      {
        "category": "정신건강",
        "strategy": "일과 휴식의 'ON/OFF'를 명확히 하여, 번아웃을 예방하고 당신의 밤을 지배하세요."
      },
      {
        "category": "운동",
        "strategy": "저녁에 고중량(4~12회) 웨이트(80%)와 가벼운 유산소(20%)를 조합하되, 컨디션에 따라 강도를 조절하세요."
      },
      {
        "category": "식단",
        "strategy": "고단백(체중x1.6g 이상) 식단을 기본으로, 혈당 안정에 신경 쓰고 스트레스성 폭식을 주의하세요."
      },
      {
        "category": "핵심",
        "strategy": "컨디션이 나쁜 날에는 과감히 쉬는 것이 당신에게는 가장 현명한 훈련입니다."
      }
    ],
    "closingMessage": "세상이 잠든 시간, 당신의 전장은 비로소 열립니다. 당신의 뜨거운 열정과 강력한 힘을 믿고, 밤의 정점에서 스스로의 한계를 뛰어넘으세요."
  }
}