{
  "OIFP": {
    "title": "밤의 코뿔소",
    "icon": "🦏",
    "summaryTitle": "The Night Rhino",
    "description": "당신은 고요한 밤의 평원을 가로지르는, 강력하고 위엄 있는 코뿔소와 같습니다. 당신의 내면에는 누구도 막을 수 없는 강렬한 열정과 저돌적인 힘이 잠재되어 있습니다. 평소에는 묵묵히 자신의 길을 가지만, 일단 목표가 생기면 모든 것을 쏟아부어 돌진합니다. 당신의 힘은 건강한 대지(식단)에서 비롯되며, 밤이 깊어질수록 더욱 강해집니다.",
    "analysis": {
      "O": "O (저녁형 / Evening-Type): 당신의 신체 시계는 늦게 시작됩니다. 뇌와 신체 기능은 늦은 오후나 저녁에 최고조에 달합니다.",
      "I": "I (스트레스 민감형 / Intense-Type): 스트레스 상황에서 신체적, 감정적 반응이 크게 나타나는 편입니다. 이는 강력한 추진력의 원천이지만, 번아웃을 막기 위한 세심한 컨디션 관리가 필수적입니다.",
      "F": "F (식이섬유 친화형 / Fiber-Type): 당신의 장내미생물은 Prevotella가 우세할 가능성이 높습니다. 식이섬유와 복합 탄수화물을 에너지로 전환하는 능력이 뛰어납니다.",
      "P": "P (파워형 / Power-Type): 당신의 근육은 순간적인 힘과 스피드를 내는 데 유리하며, 근육 성장의 잠재력이 매우 높습니다."
    },
    "strategies": [
      {
        "category": "운동",
        "categoryIcon": "🏋️‍♂️",
        "title": "잠재력을 폭발시켜 웅장한 몸을 빚어라",
        "content": "당신은 파워형(P)으로서, 근육 성장의 잠재력이 매우 높습니다. 당신의 목표는 이 잠재력을 폭발시켜 크고 웅장한 몸매를 만드는 것입니다.",
        "synergy": "당신의 운동 시너지는 '밤에 깨어나는 폭발적인 힘(O+P)'과 '그 힘을 증폭시키는 강렬한 열정(I)'의 만남입니다. 대부분의 사람들이 지쳐가는 저녁 시간, 당신의 몸과 마음은 오히려 가장 뜨겁게 타오릅니다. 당신의 강렬한 성향(I)은 고중량 훈련(P)의 한계를 넘어서는 '투쟁 본능'을 자극하여, 다른 타입이 흉내 낼 수 없는 폭발적인 퍼포먼스를 가능하게 합니다.",
        "details": [
          {
            "subtitle": "주력 훈련 (80%): 고중량 웨이트로 근육을 조각하라",
            "text": "근비대에 가장 효과적인 6~12회 반복 가능한 무게를 기본으로 하되, 근력 강화를 위해 주기적으로 4~8회의 고중량 훈련을 병행하는 것이 좋습니다. 스쿼트, 데드리프트, 벤치프레스 등 복합관절 운동을 훈련의 중심으로 삼으세요."
          },
          {
            "subtitle": "보조 훈련 (20%): 컨디셔닝으로 성장을 지원하라",
            "text": "주 1~2회, 20~30분 내외의 가벼운 유산소 운동(걷기, 사이클 등)을 추가하여 주력 훈련의 피로를 풀고 심폐 건강을 유지하세요. 지나친 유산소 운동은 근성장을 방해할 수 있으므로 강도와 시간을 제한하는 것이 중요합니다."
          },
          {
            "subtitle": "운동 시간 및 회복 전략",
            "text": "저녁형(O)으로서 당신의 골든타임은 늦은 오후나 저녁입니다. 근육군당 최소 48시간의 회복 시간이 필수적이므로, '가슴/등/하체' 같은 분할 훈련이 매우 효과적입니다. 스트레스 민감형(I)으로서 당신의 회복은 '선택'이 아닌 '필수'입니다. 정신적 스트레스가 심한 날에는 과감히 훈련 강도를 낮추거나 휴식을 취하는 유연성이 필요합니다."
          }
        ]
      },
      {
        "category": "식단",
        "categoryIcon": "🥗",
        "title": "대지를 닮은 에너지",
        "content": "당신의 근육(P)은 단백질을 원하지만, 당신의 장(F)은 섬유질을 사랑합니다. 이 둘을 조화롭게 식탁에 올리는 것이 당신 식단의 핵심입니다.",
        "synergy": "당신의 식단 시너지는 '근육의 높은 단백질 요구(P)'와 '안정적인 에너지 공급원인 장(F)', 그리고 '혈당 안정이 중요한 민감성(I)'의 절묘한 조합입니다. 당신의 장(F)은 스트레스 관리(I)에 필수적인 안정적인 에너지를 공급하는 최고의 아군입니다. 이 안정적인 기반 위에, 근성장(P)에 필요한 단백질을 의식적으로 쌓아 올릴 때, 당신은 몸과 마음의 건강을 모두 잡는 이상적인 식단을 완성할 수 있습니다.",
        "details": [
          {
            "subtitle": "고섬유 식단에 단백질 더하기",
            "text": "당신의 장 건강과 에너지 효율을 위해 식이섬유가 풍부한 식단을 유지하는 것이 좋습니다. 하지만 파워형(P) 근육을 키우기 위해서는 의식적으로 단백질 섭취량을 늘려야 합니다. 매 끼니 두부, 렌틸콩, 닭가슴살, 계란 등 양질의 단백질을 반드시 추가하여 체중 1kg당 1.6~2.0g의 단백질을 섭취하세요."
          },
          {
            "subtitle": "회복을 위한 복합 탄수화물",
            "text": "운동 후 고갈된 글리코겐을 보충하기 위해 고구마, 오트밀, 통밀빵 같은 복합 탄수화물을 섭취하세요. 이는 당신의 F타입 장이 가장 잘 활용할 수 있는 에너지원이며, 장내 유익균의 먹이가 되어 회복 환경을 개선하는 이중 효과를 줍니다."
          }
        ]
      },
      {
        "category": "정신건강 & 라이프스타일",
        "categoryIcon": "🧠",
        "title": "열정을 지혜롭게 이끄는 법",
        "content": "당신의 '강렬함(Intense)'은 양날의 검입니다. 위대한 성취를 위한 동력이 되기도 하지만, 스스로를 소진시킬 수도 있습니다. 핵심은 '전력 질주'와 '완전한 멈춤'을 의식적으로 조절하는 것입니다.",
        "synergy": "당신의 삶의 시너지는 '깊은 밤의 집중력(O)'과 '그 시간을 채우는 뜨거운 열정(I)'의 만남입니다. 당신의 밤은 누구보다 강렬하고 생산적일 수 있는 '기회의 시간'입니다. 하지만 동시에, 관리되지 않은 열정은 조급함과 불안으로 변질될 수 있습니다. 당신의 성공은 당신의 밤을 어떻게 활용하느냐에 달려있습니다.",
        "details": [
          {
            "subtitle": "'ON/OFF' 스위치를 명확히",
            "text": "당신은 한번 몰입하면 끝을 보는 스타일입니다. 당신의 골든타임인 저녁에 열정을 모두 쏟아부어 집중하고, 일이 끝나거나 운동이 끝나면 의식적으로 'OFF' 스위치를 누르세요. 운동 후 명상, 심호흡, 가벼운 산책 등은 과열된 신경계를 진정시키는 데 필수적입니다."
          },
          {
            "subtitle": "과도한 자극 피하기",
            "text": "스트레스에 민감(I)하므로, 불필요한 자극은 피하는 것이 좋습니다. 특히 수면의 질을 위해, 저녁 늦게까지 강한 빛(스마트폰 등)에 노출되는 것을 피하고 차분한 환경을 조성하여 당신의 늦은 수면 시간을 보호해야 합니다."
          }
        ]
      }
    ],
    "summaryTable": [
      {
        "category": "정신건강",
        "strategy": "일과 휴식의 'ON/OFF'를 명확히 하여, 번아웃을 예방하고 당신의 밤을 지배하세요."
      },
      {
        "category": "운동",
        "strategy": "저녁에 고중량(4~12회) 웨이트(80%)와 가벼운 유산소(20%)를 조합하되, 컨디션에 따라 강도를 조절하세요."
      },
      {
        "category": "식단",
        "strategy": "고식이섬유 식단을 기본으로, 근성장을 위해 양질의 단백질(체중x1.6g 이상)을 의식적으로 추가하세요."
      },
      {
        "category": "핵심",
        "strategy": "컨디션이 나쁜 날에는 과감히 쉬는 것이 당신에게는 가장 현명한 훈련입니다."
      }
    ],
    "closingMessage": "당신의 저돌적인 힘은 그 누구도 막을 수 없습니다. 그 힘을 현명하게 사용하여 당신 앞의 모든 장애물을 뚫고 나아가세요. 밤의 평원은 온전히 당신의 것입니다."
  }
}